docs/web developer survival guide.html
<!doctype html>
<html lang="en">
<head>
<title>Webdev Survival Handbook: UIPEP Edition</title>
<!-- 2019-04-08 Mon 13:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Paul Joshy">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Webdev Survival Handbook: UIPEP Edition</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This guide has been made keeping the daily struggles of a lot of noob developers in mind. Hopefully this could be a reference for them till they are able to independently solve problems. I will be covering the basics which I think every web developer would be using in their day to day life. This could be a bit oversimplified for advanced users but hey, we all gotta start somewhere.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The command line</h2>
<div class="outline-text-2" id="text-2">
<p>
Love it or hate it, you'll have to be working with the command line so it's best to know some useful tips.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Basic format</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The usual format for the command line is as follows
</p>

<pre class="example">
COMMAND --arg-1 --arg-2 ... file1 file2 ...
</pre>

<p>
<b>TIP</b> Abbreviated arguments are usually prefixed with a single dash and whole words are prefixed with 2 dashes.
</p>

<p>
<b>TIP</b> Abbreviated arguments can be stringed together. For example
</p>

<pre class="example">
ls -l -a
</pre>

<p>
can be shortened to
</p>

<pre class="example">
ls -la
</pre>

<p>
<b>NOTE</b> if you have properties along with arguments like how the <code>--output</code> arguments requires file names, it's usually together. For example
instead of
</p>

<pre class="example">
ssh -iv &lt;filename&gt;
</pre>

<p>
it should be
</p>

<pre class="example">
ssh -i &lt;filename&gt; -v
</pre>

<p>
As <code>&lt;filename&gt;</code> is the property of <code>-i</code> (identity file), it should be paired together.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Common arguments</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Here are common arguments which you find in a lot of terminal commands
</p>

<ul class="org-ul">
<li><code>-v</code> or <code>--verbose</code> for generating detailed output instead of showing basic information (used for debugging);
</li>
<li><code>-v</code> or <code>--version</code> for showing the version of the program.
</li>
<li><code>-h</code>, <code>--help</code> or <code>-help</code> for giving some details regarding usage of the command.
</li>
<li><code>-o</code> or <code>--output</code> for writing the output to a file.
</li>
<li><code>-a</code> or <code>--all</code> show all categories of the command including hidden categories
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Formatting options</h2>
<div class="outline-text-2" id="text-3">
<p>
This is the format that is going to be used throughout the handbook. You can refer this guide from time to time when you feel the examples are getting ambiguous.
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Format</th>
<th scope="col" class="text-left">Meaning</th>
<th scope="col" class="text-left">Examples</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Regular text</td>
<td class="text-left">Type exactly as shown</td>
<td class="text-left">git init</td>
</tr>

<tr>
<td class="text-left">&lt;Tag&gt;</td>
<td class="text-left">Replace with appropriate argument</td>
<td class="text-left">cd &lt;filename&gt;</td>
</tr>

<tr>
<td class="text-left">Elipsis (&#x2026;)</td>
<td class="text-left">You can repeat as many arguments as you want</td>
<td class="text-left">touch file1 file2 &#x2026;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Setting up</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>NOTE</b> This is only applicable to people who are using Linux. Windows and MacOS people will have to wait till I update this. Also I'll be using the <code>apt</code> Package manager in my examples but you may use whatever default manager as you like
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Git</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Installing git is as easy as
</p>

<pre class="example">
sudo apt install git -y
</pre>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Code editors</h3>
<div class="outline-text-3" id="text-4-2">
<p>
For most code editors, you can  go to their source page and download the <code>.deb</code> package. You can then double click it and the default installer appears. If you're using visual studio, you don't have to leave the terminal as there is a snap package.
</p>

<p>
First install snapd
</p>
<pre class="example">
sudo apt install snapd -y
</pre>

<p>
Then you can install vscode using snap
</p>
<pre class="example">
sudo snap install vscode --classic
</pre>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Mongodb</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Installing mongodb requires a few steps.
</p>

<p>
First, Import the public key used by the package management system.
</p>

<pre class="example">
sudo apt-key adv --keyserver hkp://keyserver.ubuntu.com:80 --recv 9DA31620334BD75D9DCB49F368818C72E52529D4
</pre>

<p>
Then, create a list file for mongodb
</p>
<pre class="example">
echo "deb [ arch=amd64 ] https://repo.mongodb.org/apt/ubuntu bionic/mongodb-org/4.0 multiverse" | sudo tee /etc/apt/sources.list.d/mongodb-org-4.0.list
</pre>

<p>
Then, do apt update
</p>
<pre class="example">
sudo apt update
</pre>

<p>
<b>NOTE</b> The newer ubuntu versions update by default but you can still run the command twice if you want
</p>

<p>
Finally, install mongodb
</p>
<pre class="example">
sudo apt-get install -y mongodb-org
</pre>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Postman</h3>
<div class="outline-text-3" id="text-4-4">
<p>
You can either download and install via your browser or you can install it from the comfort of your terminal.
</p>

<p>
First install snapd (You don't need to if you're using ubuntu I think)
</p>
<pre class="example">
sudo apt install snapd -y
</pre>

<p>
And then install postman via snap
</p>

<pre class="example">
sudo snap install postman --classic
</pre>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Node</h3>
<div class="outline-text-3" id="text-4-5">
<p>
You can install node via <code>apt</code> but it's probably best if you can change the versions whenever you want to. I personally recommend <a href="https://github.com/creationix/nvm">NVM</a>
</p>

<p>
To install nvm, type
</p>

<pre class="example">
curl -o- https://raw.githubusercontent.com/creationix/nvm/v0.34.0/install.sh | bash
</pre>

<p>
If that doesn't work try with wget
</p>

<pre class="example">
wget -qO- https://raw.githubusercontent.com/creationix/nvm/v0.34.0/install.sh | bash
</pre>

<p>
Then, source your <code>~/.bashrc</code> file by typing
</p>

<pre class="example">
source ~/.bashrc
</pre>

<p>
You can check if nvm is installed correctly by typing
</p>
<pre class="example">
command -v nvm
</pre>

<p>
If it's properly installed, you can proceed to install your version of node. Suppose you want to install v10.15.1, you can type
</p>
<pre class="example">
nvm install 10.15.1
</pre>

<p>
Once installed, you can check if the right versions are installed by typing
</p>
<pre class="example">
node -v
</pre>

<p>
and
</p>

<pre class="example">
nvm -v
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Git</h2>
<div class="outline-text-2" id="text-5">
<p>
in order to manage huge projects among multiple people and keep track of every little change, we use git. in this section we explore how to
</p>
<ul class="org-ul">
<li>Create a repository from scratch (initializing)
</li>
<li>Set up an existing repository from the cloud (cloning)
</li>
<li>Save changes (commiting)
</li>
<li>Basic troubleshooting examples and solutions
</li>
<li>Managing your own sub versions of the code (branching)
</li>
<li>Upload the contents to the cloud (pushing)
</li>
<li>Get the updated code from the cloud (pulling)
</li>
<li>Resolve conflicts when two people write code in the same file (merging)
</li>
</ul>
</div>
