docs/web developer survival guide.html

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Initializing a git repository</h3>
<div class="outline-text-3" id="text-5-1">
<p>
First create a directory using the foll code. you can also use your file manager to create a folder
</p>
<pre class="example">
mkdir &lt;project name&gt;
</pre>
<p>
Now, we need to initialize a git repository. git won't be able to track your files until you have initialized them.
</p>
<pre class="example">
git init
</pre>
<p>
You will get an error saying this is not initialized, it's probably cuz you're in the wrong folder or haven't initialized the repo in git.
</p>

<p>
Once the repository is initialized, you can continue with the development of the project. git will take care of managing the changes we've made for a particular project from now on.
you can see a snapshot of your changes by typing the following command
</p>
<pre class="example">
git status
</pre>

<p>
<b>TIP</b> This command is very useful when you have to have a quick look at the files changed, added or deleted. You can even add the <code>--short</code> tag to just view the files without any extra description
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Cloning an existing git repository</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Most of the time, you will be required to work on an existing project rather than build one from scratch. in this case, the code will be provided on the git hosting domain like <a href="https://www.github.com">Github</a>, <a href="https://bitbucket.org/">Bitbucket</a>, <a href="https://www.gitlab.com">Gitlab</a> etc.
This can be reffered to as cloning an existing repo. This can be done using the foll command
</p>
<pre class="example">
git clone &lt;git url&gt; &lt;filename&gt;
</pre>
<p>
Notice how I added the filename in the end. If we don't specify the filename, git will create a file with the same filename as the git repository's name.
</p>

<p>
<b>WARNING</b> If you try to clone a repo into an existing repo, then it will create a new repo inside the parent repo.
If you want to change the name of the repo, you can just change the filename in the git clone commmand.
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Adding files</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Just because you have initialized your repo doesn't mean git is ready to manage all your files. You have to specify which files git needs to track. You may think this is an unnecessary extra step but this way, you can have untracked files which contains sensitive information. More on that on a different thread.
</p>

<p>
It's useful to imagine the tracked and untracked files to be living in 2 different locations
</p>

<ul class="org-ul">
<li>The staging area is where git monitors all the changes.
</li>
<li>The working area is where none of the changes are monitored.
</li>
</ul>

<p>
In order for git to manage your files, you will need to add them to git. You can use the following command
</p>
<pre class="example">
git add file1 file2 ...
</pre>

<p>
<b>TIP</b> You can use <code>.</code> to add all the files in the existing direcory or <code>&lt;directory name&gt;/*</code> to include everything in a specific directory
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Commiting changes</h3>
<div class="outline-text-3" id="text-5-4">
<p>
We have learned how to Initialize a git repository from scratch and clone from
an existing repository. We even know how to view the changes we have made.
However, the true power of git lies in saving snapshots of code. To do that,
type
</p>

<pre class="example">
git commit -a -m &lt;Commit message&gt;
</pre>

<p>
In this example <code>-a</code> is used to commit all the files that are staged and <code>-m</code> is
used to write a commit message. Commit messages are used to give a short
description about the changes that you have made to the files. There is another
command that is used to view all the existing commmands in a timeline format.
This is used for viewing all the changes that you have made since the beginning.
The command is as follows
</p>

<pre class="example">
git log
</pre>

<p>
<b>TIP</b> You can also add the <code>--oneline</code> tag to view each log in a short line.
</p>

<p>
<b>NOTE</b> Try to keep log messages clean and readable. For example "Made changes" is a very vague
sentence compared to "Fixed a bug in user model". The clearer the messages are,
the easier it is for you to track down issues when they occur 
</p>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Managing branches</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Creating branches are a great way to organise our code when we are working on multiple incomplete features. I'll give you an example to illustrate.
</p>

<p>
Suppose you are working on a feature. It's buggy and you're sure that you will break your code. You have 2 options
</p>
<ul class="org-ul">
<li>Commit the code and tell them you're not ready to deploy the code as it might break. This is a waste of development time
</li>
<li>Don't commit the code and deploy the committed code. This is better but then there is no way to save your code.
</li>
</ul>

<p>
Git allows you to store your unfinished features into seperate branches so it doesn't interfere with the main source code. In fact, please use git branches when coding a new feature.
</p>

<p>
Let's check out our current branch by typing out the following command
</p>
<pre class="example">
git branch
</pre>

<p>
If you have been following the instructions, you should probably be in the master branch. To fetch all branches from the remote, you can type
</p>
<pre class="example">
git fetch --all
</pre>

<p>
You can go to an existing branch by using the checkout command
</p>
<pre class="example">
git checkout &lt;branchname&gt;
</pre>

<p>
Notice that you type <code>git branch</code> now it will still not show all the branches that you have fetched. To view that, you will have to add the <code>--all</code> argument to the command.
</p>

<p>
<b>TIP</b> You can use the <code>checkout</code> command to checkout different commits by typing the hash (the first 8 letters of a commit id).
</p>

<p>
<b>TIP</b> You can use the <code>-b</code> command along with <code>git clone</code> to clone just the specific branch instead of the default master branch. For example
</p>

<pre class="example">
git clone -b &lt;branchname&gt; &lt;git-url&gt; &lt;filename&gt;
</pre>
</div>


<div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1"><span class="section-number-4">5.5.1</span> Creating a new branch</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
You can create a new branch by typing this
</p>
<pre class="example">
git branch &lt;branchname&gt;
</pre>

<p>
<b>TIP</b> You can use the <code>-b</code> argument with the <code>checkout</code> command to create and switch to a new branch. This saves you from typing an extra command.
</p>
</div>
</div>

<div id="outline-container-sec-5-5-2" class="outline-4">
<h4 id="sec-5-5-2"><span class="section-number-4">5.5.2</span> Deleting an existing branch</h4>
<div class="outline-text-4" id="text-5-5-2">
<p>
You can delete an existing branch using the <code>-D</code> attribute along with the <code>branch</code> command. For example
</p>
<pre class="example">
git branch -D &lt;branchname&gt;
</pre>

<p>
<b>WARNING</b> Git won't allow you to delete from the branch you are currently in. Always make sure to <code>checkout</code> to a new branch before deleting it.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> Pushing and pulling your repository</h3>
<div class="outline-text-3" id="text-5-6">
<p>
Git is amazing when there are multiple people working on a single projects. Although our first instinct will be to copy paste code and share it among everyone, it's a terrible idea because of the following reasons I can think of over the top of my head
</p>

<ul class="org-ul">
<li>You won't be able to make sure you have copied and pasted everything.
</li>
<li>You will have to keep copying it to everyone's files whenever someone changes something.
</li>
<li>You won't have a reliable record of the things that has changed and the list of things needed to be updated from all the people who are working in your code
</li>
</ul>

<p>
You can use this command to pull from an existing remote branch to your branch using 
</p>
<pre class="example">
git pull origin &lt;branchname&gt;
</pre>

<p>
You can use this command to push to an existing branch in the remote using
</p>
<pre class="example">
git push origin &lt;branchname&gt;
</pre>
</div>
</div>
</div>
